app/controllers/edetails_controller.rb

SELECT `edetails`.* FROM `edetails`
---
  def index
    @edetails = Edetail.all

SELECT `edetails`.* FROM `edetails` WHERE `edetails`.`id` = 1 LIMIT 1
---
  def show
    @edetail = Edetail.find_by(id: params[:id])

SELECT `edetails`.* FROM `edetails` WHERE (1) LIMIT 1
---
  def edit
    @edetail = Edetail.find_by(params[:id])

INSERT INTO `edetails` (`age`, `basic_pay`, `created_at`, `ename`, `gender`, `pf_deduction`, `updated_at`) VALUES (24, 10000.0, '2014-05-18 03:58:51', 'smith', 'male', 500.0, '2014-05-18 03:58:51')
---
  def create
    @edetail = Edetail.new(edetail_params)


    if @edetail.save

SELECT `edetails`.* FROM `edetails` WHERE (1) LIMIT 1
UPDATE `edetails` SET `age` = 23, `basic_pay` = 4555.0, `pf_deduction` = 100.0, `updated_at` = '2014-05-17 13:05:56' WHERE `edetails`.`id` = 1
---
  def update
    @edetail = Edetail.find_by(params[:id])
    if @edetail.update(edetail_params)

SELECT `edetails`.* FROM `edetails` WHERE (2) LIMIT 1
DELETE FROM `edetails` WHERE `edetails`.`id` = 1
---
  def destroy
    @edetail = Edetail.find_by(params[:id])
    @edetail.destroy