app/controllers/edetails_controller.rb

  def edit
    @edetail = Edetail.find_by(id: params[:id])
---
SELECT `edetails`.* FROM `edetails` WHERE `edetails`.`id` = 1 LIMIT 1

  def update
    @edetail = Edetail.find_by(id: params[:id])
---
SELECT `edetails`.* FROM `edetails` WHERE `edetails`.`id` = 1 LIMIT 1